In [5]:
import numpy as np
import pandas as pd

In [3]:
n=np.array([1,2,3,4,40])

In [4]:
n

array([ 1,  2,  3,  4, 40])

In [6]:
x=pd.Series(n)

In [7]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [8]:
type(x)

pandas.core.series.Series

In [9]:
type(n)

numpy.ndarray

In [10]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [11]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [12]:
b[0]

1

In [14]:
b[2][0]

11

In [15]:
b[2][:]

[11, 10]

In [16]:
b[:]

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [17]:
b[1:4]

1           2
2    [11, 10]
3          33
dtype: object

In [18]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [19]:
d=pd.Series({'a':10,'b':15,'c':56,'d':90})

In [20]:
d['d']

90

In [21]:
d['b':]

b    15
c    56
d    90
dtype: int64

In [22]:
d.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [24]:
d['a']

10

In [27]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [26]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [28]:
s=pd.Series([12,52,42,10,23],index=list('qwert'))

In [29]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [31]:
s['q']

12

In [32]:
s[:]

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [33]:
s1=pd.Series([12,52,12,52,10,23,42,10,23])

In [37]:
s1.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [38]:
s1.argmax()

1

In [39]:
s1.argmin()

4

In [40]:
s.argmax()

1

In [41]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [42]:
s.argmax()

1

In [43]:
s.max()

52

In [44]:
s[1]

52

In [45]:
s[:1]

q    12
dtype: int64

In [50]:
s[s.argmax():s.argmax()+1]

w    52
dtype: int64

In [47]:
s.idxmax()

'w'

# DataFrame

In [51]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [52]:
a

Empty DataFrame
Columns: []
Index: []

In [53]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [54]:
b[0]

0     1
1     2
2    55
3    40
4    86
Name: 0, dtype: int64

In [57]:
b[0][1]

2

In [58]:
type(b)

pandas.core.frame.DataFrame

In [79]:
c=pd.DataFrame([[1,2],[55,40,86]])

In [80]:
c

    0   1     2
0   1   2   NaN
1  55  40  86.0

In [73]:
d=pd.DataFrame([[1,2,3,45,54],[10,20,30,23,32],[7,8,9,23,32],[1,2,3,4,5],[1,2,3,4,5]])

In [72]:
d

    0   1   2   3   4
0   1   2   3  45  54
1  10  20  30  23  32
2   7   8   9  23  32
3   1   2   3   4   5
4   1   2   3   4   5

In [66]:
type(d)

pandas.core.frame.DataFrame

In [70]:
d

    0   1   2    3    4
0   1   2   3  NaN  NaN
1  10  20  30  NaN  NaN
2   7   8   9  NaN  NaN
3   1   2   3  4.0  5.0
4   1   2   3  4.0  5.0

In [74]:
d

    0   1   2   3   4
0   1   2   3  45  54
1  10  20  30  23  32
2   7   8   9  23  32
3   1   2   3   4   5
4   1   2   3   4   5

In [75]:
d[4][4]

5

In [81]:
d.head()

    0   1   2   3   4
0   1   2   3  45  54
1  10  20  30  23  32
2   7   8   9  23  32
3   1   2   3   4   5
4   1   2   3   4   5

In [82]:
d.tail()

    0   1   2   3   4
0   1   2   3  45  54
1  10  20  30  23  32
2   7   8   9  23  32
3   1   2   3   4   5
4   1   2   3   4   5

In [83]:
d.tail(2)

   0  1  2  3  4
3  1  2  3  4  5
4  1  2  3  4  5

In [84]:
d.head()

    0   1   2   3   4
0   1   2   3  45  54
1  10  20  30  23  32
2   7   8   9  23  32
3   1   2   3   4   5
4   1   2   3   4   5

In [85]:
d.head(2)

    0   1   2   3   4
0   1   2   3  45  54
1  10  20  30  23  32

In [86]:
d.sample()

   0  1  2   3   4
0  1  2  3  45  54

In [88]:
d.sample(3)

    0   1   2   3   4
1  10  20  30  23  32
4   1   2   3   4   5
2   7   8   9  23  32

In [91]:
e=pd.DataFrame([[12,34],[1,2,3],[7,8],[5,8,9],[74,100]])

In [92]:
e

    0    1    2
0  12   34  NaN
1   1    2  3.0
2   7    8  NaN
3   5    8  9.0
4  74  100  NaN

In [93]:
e[1][1]

2

In [99]:
e

    0      1    2
0  12   34.0  NaN
1   1    NaN  3.0
2   7    8.0  NaN
3   5    8.0  9.0
4  74  100.0  NaN

In [100]:
e[1][1]=np.nan

In [101]:
e[1][1]=3

In [96]:
e

    0      1    2
0  12   34.0  NaN
1   1    3.0  3.0
2   7    8.0  NaN
3   5    8.0  9.0
4  74  100.0  NaN

In [97]:
e[1][1]=np.nan

In [98]:
e

    0      1    2
0  12   34.0  NaN
1   1    NaN  3.0
2   7    8.0  NaN
3   5    8.0  9.0
4  74  100.0  NaN

In [110]:
e=pd.DataFrame([[12,34],[np.nan,2,3],[7,8],[5,'missing',9],[74,100]],index=list('qwert'))

In [104]:
e

    0        1    2
0  12       34  NaN
1   1        2  3.0
2   7        8  NaN
3   5  missing  9.0
4  74      100  NaN

In [105]:
e[1][1]=np.nan

C:\Users\HP\AppData\Local\Temp\ipykernel_8396\2467043310.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  e[1][1]=np.nan

In [106]:
e

    0        1    2
0  12       34  NaN
1   1      NaN  3.0
2   7        8  NaN
3   5  missing  9.0
4  74      100  NaN

In [108]:
3

3

In [109]:
e

      0        1    2
0  12.0       34  NaN
1   NaN        2  3.0
2   7.0        8  NaN
3   5.0  missing  9.0
4  74.0      100  NaN

In [111]:
e

      0        1    2
q  12.0       34  NaN
w   NaN        2  3.0
e   7.0        8  NaN
r   5.0  missing  9.0
t  74.0      100  NaN

In [117]:
e=pd.DataFrame([[12,34],[np.nan,2,3],[7,8],[5,'missing',9],[74,100]],index=list('qwert'),columns=list('abc'))

In [113]:
e

      a        b    c
q  12.0       34  NaN
w   NaN        2  3.0
e   7.0        8  NaN
r   5.0  missing  9.0
t  74.0      100  NaN

In [122]:
e['b']

q         34
w          2
e          8
r    missing
t        100
Name: b, dtype: object

In [127]:
e[['b','c']]

         b    c
q       34  NaN
w        2  3.0
e        8  NaN
r  missing  9.0
t      100  NaN

In [128]:
e[:]

      a        b    c
q  12.0       34  NaN
w   NaN        2  3.0
e   7.0        8  NaN
r   5.0  missing  9.0
t  74.0      100  NaN

In [136]:
e['b']['q']

34

In [142]:
e[['b','c']][0:3]

    b    c
q  34  NaN
w   2  3.0
e   8  NaN

In [143]:
e[['b','c']].head(3)

    b    c
q  34  NaN
w   2  3.0
e   8  NaN

In [145]:
e.shape

(5, 3)

In [147]:
e['a'].max()

74.0

In [148]:
e['d']=list('12344')

In [149]:
e

      a        b    c  d
q  12.0       34  NaN  1
w   NaN        2  3.0  2
e   7.0        8  NaN  3
r   5.0  missing  9.0  4
t  74.0      100  NaN  4

In [152]:
e['d']=5

In [153]:
e

      a        b    c  d
q  12.0       34  NaN  5
w   NaN        2  3.0  5
e   7.0        8  NaN  5
r   5.0  missing  9.0  5
t  74.0      100  NaN  5

In [156]:
e['d']=[e[b][q]+e[c][q],e[b][w]+e[c][w],e[b][e]+e[c][e],e[b][r]+e[c][r],e[b][t]+e[b][t]]

NameError: name 'q' is not defined

In [157]:
e[b][q]

NameError: name 'q' is not defined

In [159]:
e['d']=[e['b']['q']+e['c']['q'],e['b']['w']+e['c']['w'],e['b']['e']+e['c']['e'],e['b']['r']+e['c']['r'],e['b']['t']+e['b']['t']]

TypeError: can only concatenate str (not "numpy.float64") to str

In [160]:
e['b']['r']=5

C:\Users\HP\AppData\Local\Temp\ipykernel_8396\1107017767.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  e['b']['r']=5

In [161]:
e['b']['r']

5

In [162]:
e['d']=[e['b']['q']+e['c']['q'],e['b']['w']+e['c']['w'],e['b']['e']+e['c']['e'],e['b']['r']+e['c']['r'],e['b']['t']+e['b']['t']]

In [163]:
e

      a    b    c      d
q  12.0   34  NaN    NaN
w   NaN    2  3.0    5.0
e   7.0    8  NaN    NaN
r   5.0    5  9.0   14.0
t  74.0  100  NaN  200.0

In [164]:
e['colD']=e['b']+e['c']

In [165]:
e

      a    b    c      d  colD
q  12.0   34  NaN    NaN   NaN
w   NaN    2  3.0    5.0   5.0
e   7.0    8  NaN    NaN   NaN
r   5.0    5  9.0   14.0  14.0
t  74.0  100  NaN  200.0   NaN

In [166]:
del e['colD']

In [167]:
e

      a    b    c      d
q  12.0   34  NaN    NaN
w   NaN    2  3.0    5.0
e   7.0    8  NaN    NaN
r   5.0    5  9.0   14.0
t  74.0  100  NaN  200.0

In [168]:
e['d'].max()

200.0

In [169]:
e['d']

q      NaN
w      5.0
e      NaN
r     14.0
t    200.0
Name: d, dtype: float64

In [171]:
e['d'].max()

200.0

In [172]:
e['d']>50

q    False
w    False
e    False
r    False
t     True
Name: d, dtype: bool

In [173]:
f=e['d']>6

In [174]:
e[f]

      a    b    c      d
r   5.0    5  9.0   14.0
t  74.0  100  NaN  200.0

In [175]:
e[e['d']>6]

      a    b    c      d
r   5.0    5  9.0   14.0
t  74.0  100  NaN  200.0

In [176]:
e[f]['d']

r     14.0
t    200.0
Name: d, dtype: float64